{
    "Prompt 1": {
        "Input": " The dataset consists of 246 rows and contains various demographic and professional information. 19.1% of all participants are female. The proportion of those with a Master's degree is 26.8%. The most frequently worked sector is IT (51.2%), and the most common problem identified is \"Requirements are not fully/correctly documented\" (43.5%). ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " The survey consists of 246 people. 19.1% of the participants are female, 26.8% have a Master's degree, and 51.2% work in the IT sector. Based on this, calculate the total number of people who are female, have a Master's degree, and work in the IT sector. "
    },
    "Prompt 2": {
        "Input": " The dataset includes 246 participants. The average age is 33.32, and the median is 32.0. 38.6% of the participants live in ANKARA, while 19.1% live in ISTANBUL. The percentage of those working in the IT sector is 51.2%. The most preferred software methodology in companies is Agile (58.9%). ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " Of the 246 participants, 38.6% live in Ankara, 19.1% live in Istanbul. 51.2% work in the IT sector. The most used methodology is Agile (58.9%). Based on this, calculate the total number of participants who live in Ankara, work in the IT sector, and use the Agile methodology. "
    },
    "Prompt 3": {
        "Input": " The survey is based on data from 246 participants. The most common job position is Software Engineer/Specialist with 122 people (49.6%). 10.6% of the participants have 1 year of work experience. 57.7% of the companies export software abroad. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " There are 246 people in the survey. 49.6% are Software Engineers, 10.6% have 1 year of experience, and 57.7% work for a company that exports software. Based on this, find the total number of participants who are in the position of Software Engineer/Specialist, have 1 year of work experience, and whose company exports software abroad. "
    },
    "Prompt 4": {
        "Input": " The survey provides data for 246 people. 24.4% of the participants work in companies with more than 1000 employees. The most common software development lifecycle methodology used is Agile (58.9%). 48% of the companies do not have a Software Quality Unit. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " 24.4% of 246 people work in large companies (>1000 employees), and 58.9% work with the Agile methodology. 48% of the companies do not have a Software Quality Unit. Based on this, calculate the total number of people who work in companies with more than 1000 employees, use the Agile methodology, and whose companies do not have a Software Quality Unit. "
    },
    "Prompt 5": {
        "Input": " According to the analysis of the 246 rows in the dataset, 45.1% of the participants receive post-recruitment orientation training. The percentage of those who have never received training on software quality standards is 39.0%. The percentage of those who believe that quality standards facilitate internal communication is 37.0%. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " The survey consists of 246 people. 39.0% of the participants have not received training on quality standards and 37.0% say \"I absolutely agree\" that standards facilitate communication. Based on this, find the total number of participants who have not received training on software quality standards but \"absolutely agree\" that quality standards facilitate communication. "
    },
    "Prompt 6": {
        "Input": " Of the total 246 participants, 80.5% are male and 64.2% have a Bachelor's degree. 34.6% of the participants stated that they \"frequently\" experience the problem of \"Acceptance Criteria not being determined\". 30.5% stated that their companies' \"Information Management process\" is \"There is a named but undocumented process\". ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " 80.5% of 246 participants are male and 64.2% have a Bachelor's degree. 34.6% \"frequently\" experience the problem of \"Acceptance Criteria not being determined\". Based on this, calculate the total number of male participants with a Bachelor's degree who \"frequently\" experience the problem of \"Acceptance criteria not being determined\" at their workplace. "
    },
    "Prompt 7": {
        "Input": " 49.6% of the 246 survey participants work in the position of Software Engineer/Specialist. 26.8% of this group have a Master's degree. 31.3% of the participants stated that their testing processes are \"There is a documented process\". ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " 49.6% of 246 participants are Software Engineers, 26.8% have a Master's degree, and 31.3% have a documented testing process. Based on this, find the total number of participants who work as Software Engineer/Specialist, have a Master's degree, and state that their companies have a documented testing process. "
    },
    "Prompt 8": {
        "Input": " The analysis of the 246-participant dataset shows that 10.6% have 1 year, 8.1% have 2 years, and 7.3% have 5 years of work experience. 42.3% of the participants stated that their companies have a Software Quality Unit. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " The survey includes 246 people. 10.6% have 1 year, 8.1% have 2 years, and 7.3% have 5 years of work experience. 42.3% of the companies have a Software Quality Unit. Based on this, calculate the total number of participants who have a Software Quality Unit in their company and have 1, 2, or 5 years of work experience. "
    },
    "Prompt 9": {
        "Input": " The survey contains data on the professional experiences and problems faced by 246 participants. 18.7% of the participants stated that they \"always\" experience the problem of \"Change requests cannot be controlled\". 11.8% stated that their \"Risk management process\" is \"There is a functioning, documented process\". ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " 18.7% of 246 participants stated that they \"always\" experience the problem of \"Change requests cannot be controlled\", and 11.8% stated that they have a \"documented risk management process\". Based on this, find the total number of people who \"always\" experience the problem of \"Change requests cannot be controlled\" and also work in companies with a \"documented risk management process\". "
    },
    "Prompt 10": {
        "Input": " In the 246-person dataset, 37.0% of the participants \"absolutely agree\" that quality standards facilitate internal communication. 45.1% of this group also receive post-recruitment orientation training. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " 37.0% of 246 participants \"absolutely agree\" that quality standards facilitate communication, and 45.1% of this group receive post-recruitment orientation training. Based on this, calculate the total number of participants who \"absolutely agree\" that quality standards facilitate communication and who also receive post-recruitment orientation training. "
    },
    "Prompt 11": {
        "Input": " The dataset includes 246 people. 51.2% of them work in the IT sector. 48.0% of the participants' companies do not have a Software Quality Unit. The proportion of those using the Agile methodology is 58.9%. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " Of the 246 people, 51.2% work in the IT sector, 58.9% use the Agile methodology, and 48.0% do not have a Software Quality Unit in their company. Based on this, find the total number of participants who work in the IT sector, use the Agile methodology, and whose companies do not have a Software Quality Unit. "
    },
    "Prompt 12": {
        "Input": " The survey includes demographic and professional characteristics of 246 participants. 64.2% of the participants have a Bachelor's degree, while 26.8% have a Master's degree. 16.3% of those who \"frequently\" experience the problem of \"Code reviews are not performed\" have a Master's degree. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " 26.8% of 246 participants have a Master's degree. 16.3% of those who \"frequently\" experience the problem of \"Code reviews are not performed\" are Master's degree holders. Based on this, calculate the total number of participants with a Master's degree who \"frequently\" experience the problem of \"Code reviews are not performed\". "
    },
    "Prompt 13": {
        "Input": " The analysis of the 246-person dataset shows that 19.1% of the participants are female, and 13.8% work in the position of Team Leader/Group Leader. 24.4% of the participants work in companies with more than 1000 employees. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " Of the 246 people, 19.1% are female, 13.8% are Team Leaders, and 24.4% work in companies with more than 1000 employees. Based on this, calculate the total number of people who are female, work as a Team Leader/Group Leader, and are employed by a company with more than 1000 employees. "
    },
    "Prompt 14": {
        "Input": " The dataset includes 246 people. 34.6% of the participants stated that their companies do not have a Software Quality Unit. 16.7% do not receive post-recruitment orientation training. One of the most frequently used testing methods is User Acceptance Testing (3.3%). ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " There are 246 people in the survey. 34.6% work in a company without a Software Quality Unit, 16.7% do not receive orientation training, and 3.3% use User Acceptance Testing. Based on this, find the total number of participants who work in a company without a Software Quality Unit, do not receive post-recruitment orientation training, and use User Acceptance Testing. "
    },
    "Prompt 15": {
        "Input": " According to the survey data, 57.7% of the participants' companies export software abroad. 38.6% of these participants live in Ankara. 33.3% of the participants stated that they \"sometimes\" experience the problem of \"Risks are not managed\". ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " Of the 246 participants, 57.7% work in a company that exports software abroad, 38.6% live in Ankara, and 33.3% \"sometimes\" experience the problem of \"Risks are not managed\". Based on this, calculate the total number of participants who live in Ankara, work in a company that exports software abroad, and \"sometimes\" experience the problem of \"Risks are not managed\". "
    },
    "Prompt 16": {
        "Input": " In the 246-person dataset, 49.6% work in the position of Software Engineer/Specialist, while 13.8% are in the position of Team Leader/Group Leader. The proportion of those who \"frequently\" experience the problem of \"Project plan is not done correctly\" is 24.4%. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " Of the 246 participants, 49.6% are Software Engineers or 13.8% are Team Leaders. 24.4% \"frequently\" experience the problem of \"Project plan is not done correctly\". Based on this, find the total number of participants who are in the position of Software Engineer/Specialist or Team Leader/Group Leader and \"frequently\" experience the problem of \"Project plan is not done correctly\". "
    },
    "Prompt 17": {
        "Input": " According to the survey data of 246 people, 26.8% of the participants have a Master's degree. The proportion of those who state that their companies' \"Testing Process\" is \"There is a documented process\" is 33.3%. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " 26.8% of 246 participants have a Master's degree, and 33.3% stated that they have a documented testing process. Based on this, calculate the total number of participants with a Master's degree who have a documented testing process in their companies. "
    },
    "Prompt 18": {
        "Input": " The dataset includes 246 people. 31.3% of the participants stated that they \"sometimes\" experience the problem of \"Test plans are not made\". 24.4% of the participants work in companies with more than 1000 employees. The proportion of those using the Agile methodology is 58.9%. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " 31.3% of 246 participants \"sometimes\" experience the problem of test plans not being made, 24.4% work in large companies, and 58.9% use Agile. Based on this, find the total number of participants who work in a company with more than 1000 employees, use the Agile methodology, and \"sometimes\" experience the problem of \"Test plans are not made\". "
    },
    "Prompt 19": {
        "Input": " According to the survey data, 30.1% of 246 participants stated that their \"Integration Process\" is \"There is a documented process\". 51.2% of these participants work in the IT sector. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " Of the 246 participants, 30.1% have a documented integration process and 51.2% work in the IT sector. Based on this, calculate the total number of participants who work in the IT sector and have a \"documented integration process\" in their companies. "
    },
    "Prompt 20": {
        "Input": " Of the total 246 participants, 80.5% are male. 38.6% of these males live in Ankara. 43.5% of the participants stated that they \"frequently\" experience the problem of \"Requirements are not fully/correctly documented\". ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " 80.5% of 246 people are male, 38.6% live in Ankara, and 43.5% \"frequently\" experience the problem of \"Requirements are not fully/correctly documented\". Based on this, calculate the total number of participants who live in Ankara, are male, and \"frequently\" experience the problem of \"Requirements are not fully/correctly documented\". "
    },
    "Prompt 21": {
        "Input": " The survey is based on data from 246 participants. The most common job position is Software Engineer/Specialist with 122 people (49.6%). 34.6% of the participants stated that they \"frequently\" experience the problem of \"Acceptance Criteria not being determined\". 57.7% of the companies export software abroad. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " 49.6% of 246 participants are Software Engineers, 34.6% \"frequently\" experience the problem of \"Acceptance Criteria not being determined\", and 57.7% work in a company that exports software abroad. Based on this, find the total number of participants who work in the position of Software Engineer/Specialist, \"frequently\" experience the problem of \"Acceptance Criteria not being determined\", and whose company exports software abroad. "
    },
    "Prompt 22": {
        "Input": " The dataset includes 246 participants. The average age is 33.32, and the median is 32.0. 42.3% of the participants stated that their companies have a Software Quality Unit, and 19.1% reside in ISTANBUL. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " 42.3% of 246 participants' companies have a Software Quality Unit and 19.1% of them live in Istanbul. Based on this, calculate the total number of participants who live in Istanbul and have a Software Quality Unit in their company. "
    },
    "Prompt 23": {
        "Input": " According to the survey data, 36.2% of the 246 participants stated that their \"Project Planning Process\" is \"There is a documented process\". 58.9% of these participants use the Agile methodology. The proportion of male participants is 80.5%. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " 36.2% of 246 participants have a documented project planning process, 58.9% use Agile, and 80.5% are male. Based on this, find the total number of participants who have a documented project planning process, use the Agile methodology, and are male. "
    },
    "Prompt 24": {
        "Input": " The dataset includes 246 people. 16.7% of the participants stated that they \"never\" experience the problem of \"Lack of communication within the team\". 64.2% of these participants have a Bachelor's degree. The proportion of those working in the IT sector is 51.2%. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " Of the 246 participants, 16.7% have \"never\" experienced \"Lack of communication within the team\", 64.2% have a Bachelor's degree, and 51.2% work in the IT sector. Based on this, calculate the total number of participants who work in the IT sector, have a Bachelor's degree, and have \"never\" experienced the problem of \"Lack of communication within the team\". "
    },
    "Prompt 25": {
        "Input": " According to the 246-person dataset, 31.3% of the participants stated that they \"never\" experience the problem of \"Version control is not performed\". 45.1% of these participants also receive post-recruitment orientation training. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " 31.3% of 246 participants have \"never\" experienced a version control problem, and 45.1% receive post-recruitment orientation training. Based on this, find the total number of participants who have \"never\" experienced the problem of \"Version control is not performed\" and also receive post-recruitment orientation training. "
    },
    "Prompt 26": {
        "Input": " According to the survey data, 37.0% of the 246 participants stated that they \"sometimes\" experience the problem of \"Architectural design is not done correctly\". 48.0% of these participants' companies do not have a Software Quality Unit. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " 37.0% of 246 participants \"sometimes\" experience an architectural design problem, and 48.0% of these participants' companies do not have a Software Quality Unit. Based on this, calculate the total number of participants who \"sometimes\" experience the problem of \"Architectural design is not done correctly\" and whose companies do not have a Software Quality Unit. "
    },
    "Prompt 27": {
        "Input": " The dataset includes 246 people. 24.4% of the participants work in companies with more than 1000 employees, and 16.7% work in companies with 11-50 employees. The proportion of those using the Agile methodology in projects is 58.9%. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " Of the 246 participants, 24.4% work in large companies and 16.7% work in small companies. 58.9% use the Agile methodology. Based on this, compare the total number of participants who work in companies with more than 1000 employees and use the Agile methodology with those who work in companies with 11-50 employees and use the Agile methodology. "
    },
    "Prompt 28": {
        "Input": " The survey contains data on the professional experiences and problems faced by 246 participants. 18.7% of the participants stated that they \"always\" experience the problem of \"Change requests cannot be controlled\". The proportion of those working in the IT sector is 51.2%. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " 18.7% of 246 participants \"always\" experience a change request problem and 51.2% work in the IT sector. Based on this, find the total number of participants who work in the IT sector and \"always\" experience the problem of \"Change requests cannot be controlled\". "
    },
    "Prompt 29": {
        "Input": " Of the total 246 participants, 49.6% work in the position of Software Engineer/Specialist, while 13.8% work in the position of Team Leader/Group Leader. 30.9% of the participants stated that they \"sometimes\" experience the problem of \"The practice of getting feedback by designing a prototype is not implemented\". ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " 49.6% of 246 participants are in the position of Software Engineer and 30.9% \"sometimes\" cannot get prototype feedback. Based on this, calculate the total number of participants who work in the position of Software Engineer/Specialist and \"sometimes\" experience the problem of \"The practice of getting feedback by designing a prototype is not implemented\". "
    },
    "Prompt 30": {
        "Input": " According to the survey data, 39.0% of 246 participants have never received training on software quality standards. 48.0% of these people's companies do not have a Software Quality Unit. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " 39.0% of 246 participants have not received quality standards training, and 48.0% of these people's companies do not have a Software Quality Unit. Based on this, find the total number of participants who have not received training on software quality standards and whose company does not have a Software Quality Unit. "
    },
    "Prompt 31": {
        "Input": " Of the total 246 participants, 38.6% live in ANKARA, and 19.1% live in ISTANBUL. The most common software methodology used is Agile (58.9%). ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " Of the 246 participants, 38.6% live in Ankara, 19.1% live in Istanbul, and 58.9% use the Agile methodology. Based on this, compare the total number of participants who live in Ankara and use the Agile methodology with those who live in Istanbul and use Agile. "
    },
    "Prompt 32": {
        "Input": " The dataset includes 246 participants. The average age is 33.32, and the median is 32.0. The most common years of work experience are 1 year (10.6%), 2 years (8.1%), and 5 years (7.3%). ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " 10.6% of 246 participants have 1 year, 8.1% have 2 years, and 7.3% have 5 years of work experience. Based on this, calculate the total number of participants with 5 years or less of work experience. "
    },
    "Prompt 33": {
        "Input": " The survey is based on data from 246 participants. The proportion of those working in the IT sector is 51.2%. The proportion of those whose company has a Software Quality Unit is 42.3%. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " Of the 246 participants, 51.2% work in the IT sector and 42.3% have a Software Quality Unit in their company. Based on this, calculate the total number of participants who work in the IT sector and have a Software Quality Unit in their company. "
    },
    "Prompt 34": {
        "Input": " In the 246-person dataset, 31.7% of the participants stated that they \"rarely\" experience the problem of \"Lack of communication\". 48.0% of the companies do not have a Software Quality Unit. The most common job position is Software Engineer/Specialist with 122 people (49.6%). ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " 31.7% of 246 participants \"rarely\" experience a lack of communication, 48.0% of their companies do not have a Software Quality Unit, and 49.6% are Software Engineers. Based on this, find the total number of participants who work in the position of Software Engineer/Specialist, work in a company without a Software Quality Unit, and \"rarely\" experience the problem of \"Lack of communication within the team\". "
    },
    "Prompt 35": {
        "Input": " The survey includes demographic and professional characteristics of 246 participants. 19.1% of the participants are female, while 80.5% are male. 57.7% of the companies stated that they export software abroad. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " 19.1% of 246 participants are female, 80.5% are male, and 57.7% work in a company that exports software. Based on this, calculate the total number of female participants whose company exports software abroad. "
    },
    "Prompt 36": {
        "Input": " In the 246-person dataset, 45.1% of the participants receive post-recruitment orientation training. 58.9% of these participants use the Agile methodology. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " 45.1% of 246 participants receive post-recruitment orientation training and 58.9% use the Agile methodology. Based on this, find the total number of participants who receive post-recruitment orientation training and use the Agile methodology. "
    },
    "Prompt 37": {
        "Input": " The survey contains data on the professional experiences and problems faced by 246 participants. 31.3% of the participants stated that they \"never\" experience the problem of \"Version control is not performed\". 34.6% stated that they \"frequently\" experience the problem of \"Acceptance Criteria not being determined\". ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " 31.3% of 246 participants have \"never\" experienced a version control problem, and 34.6% \"frequently\" experience an acceptance criteria problem. Based on this, calculate the total number of participants who have \"never\" experienced the problem of \"Version control is not performed\" and at the same time \"frequently\" experience the problem of \"Acceptance Criteria not being determined\". "
    },
    "Prompt 38": {
        "Input": " The dataset includes 246 people. 10.6% of the participants have 1 year of work experience, while 8.1% have 2 years. The proportion of those working in the IT sector is 51.2%. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " 10.6% of 246 participants have 1 year, 8.1% have 2 years of work experience, and 51.2% work in the IT sector. Based on this, calculate the total number of participants who have 1 or 2 years of work experience and work in the IT sector. "
    },
    "Prompt 39": {
        "Input": " The survey includes demographic and professional characteristics of 246 participants. 49.6% of the participants are in the position of Software Engineer/Specialist and 26.8% have a Master's degree. 57.7% of the companies export software abroad. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " 49.6% of 246 participants are Software Engineers, 26.8% have a Master's degree, and 57.7% work in a company that exports software. Based on this, find the total number of participants who work as a Software Engineer/Specialist, have a Master's degree, and whose company exports software abroad. "
    },
    "Prompt 40": {
        "Input": " Of the total 246 participants, 37.0% stated that they \"sometimes\", and 25.2% stated that they \"rarely\" experience the problem of \"Architectural design is not done correctly\". The most common software methodology used is Agile (58.9%). ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " 37.0% of 246 participants \"sometimes\", and 25.2% \"rarely\" experience an architectural design problem, and 58.9% use the Agile methodology. Based on this, calculate the total number of participants who use the Agile methodology and \"sometimes\" or \"rarely\" experience the problem of \"Architectural design is not done correctly\". "
    },
    "Prompt 41": {
        "Input": " The dataset includes 246 people. 31.3% of the participants stated that they \"sometimes\" experience the problem of \"Errors are not managed\". 48.0% of these people's companies do not have a Software Quality Unit. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " 31.3% of 246 participants \"sometimes\" experience an error management problem, and 48.0% of their companies do not have a Software Quality Unit. Based on this, calculate the total number of participants who \"sometimes\" experience the problem of \"Errors are not managed\" and whose company does not have a Software Quality Unit. "
    },
    "Prompt 42": {
        "Input": " According to the survey data, 38.6% of 246 participants live in ANKARA, and 7.3% live in İZMİR. The proportion of those working in the IT sector is 51.2%. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " Of the 246 participants, 38.6% live in Ankara, 7.3% live in İzmir, and 51.2% work in the IT sector. Based on this, compare the total number of participants who live in Ankara and work in the IT sector with those who live in İzmir and work in the IT sector. "
    },
    "Prompt 43": {
        "Input": " Of the total 246 participants, 49.6% work in the position of Software Engineer/Specialist, while 8.9% work in the position of Director/Senior Management. The average age is 33.32. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " 49.6% of 246 participants are Software Engineers, and 8.9% are in Director/Senior Management positions. Based on this, compare the total number of participants working as a Software Engineer/Specialist with those working in a Director/Senior Management position. "
    },
    "Prompt 44": {
        "Input": " The survey contains data on the professional experiences and problems faced by 246 participants. 43.5% of the participants stated that they \"frequently\" experience the problem of \"Requirements are not fully/correctly documented\". 64.2% of these participants have a Bachelor's degree. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " 43.5% of 246 participants \"frequently\" experience a requirements documentation problem, and 64.2% of these people have a Bachelor's degree. Based on this, calculate the total number of participants who have a Bachelor's degree and \"frequently\" experience the problem of \"Requirements are not fully/correctly documented\". "
    },
    "Prompt 45": {
        "Input": " The dataset includes 246 people. 57.7% of the participants stated that they work in a company that exports software abroad, while 34.6% answered NO. The proportion of those whose company has a Software Quality Unit is 42.3%. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " 57.7% of 246 participants work in a company that exports software abroad, and 34.6% answered no. 42.3% of their companies have a Software Quality Unit. Based on this, calculate the total number of participants who work in a company that exports software abroad and have a Software Quality Unit in their company. "
    },
    "Prompt 46": {
        "Input": " The survey is based on data from 246 participants. 31.3% of the participants stated that they \"rarely\" experience the problem of \"The technical competence of the software team is insufficient\". 51.2% of these participants work in the IT sector. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " 31.3% of 246 participants \"rarely\" experience a competence problem, and 51.2% of these people work in the IT sector. Based on this, find the total number of participants who work in the IT sector and \"rarely\" experience the problem of \"The technical competence of the software team is insufficient\". "
    },
    "Prompt 47": {
        "Input": " Of the total 246 participants, 36.2% answered \"Insufficient/short orientation is provided\". 34.6% of these participants stated that they \"frequently\" experience the problem of \"Acceptance Criteria not being determined\". ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " 36.2% of 246 participants stated that they received insufficient orientation, and 34.6% stated that they \"frequently\" experience an acceptance criteria problem. Based on this, calculate the total number of participants who received insufficient orientation and \"frequently\" experience the problem of \"Acceptance Criteria not being determined\". "
    },
    "Prompt 48": {
        "Input": " The dataset includes 246 participants. 64.2% of the participants have a Bachelor's degree and 49.6% are in the position of Software Engineer/Specialist. The proportion of those whose company has a Software Quality Unit is 42.3%. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " 64.2% of 246 participants have a Bachelor's degree, 49.6% are Software Engineers, and 42.3% of their companies have a Software Quality Unit. Based on this, calculate the total number of participants who have a Bachelor's degree, work in the position of Software Engineer/Specialist, and have a Software Quality Unit in their company. "
    },
    "Prompt 49": {
        "Input": " The survey contains data on the professional experiences and problems faced by 246 participants. 30.5% of the participants stated that their companies' \"Information Management Process\" is \"There is a named but undocumented process\". 51.2% of these participants work in the IT sector. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " 30.5% of 246 participants' information management process is undocumented, and 51.2% of these people work in the IT sector. Based on this, find the total number of participants who work in the IT sector and whose information management process is undocumented. "
    },
    "Prompt 50": {
        "Input": " Of the total 246 participants, 10.6% have 1 year, 8.1% have 2 years, and 6.9% have 3 years of work experience. 58.9% of the participants use the Agile methodology, and 9.8% use the Waterfall methodology. ",
        "Long filler text": " This is an experimental environment similar to a needle-in-a-haystack test, where important information is deeply embedded within a comprehensive prompt. The model is expected to process the entire input and respond to the resulting query without the aid of any external memory or restructuring. Missing values in the dataset are minimal, at 1.1% in total. Categorical columns list the highest frequencies, for example, Agile methodology users are 58.9%. ",
        "Question": " Of the 246 participants, 10.6% have 1 year, 8.1% have 2 years of work experience, and 58.9% use the Agile methodology, and 9.8% use the Waterfall methodology. Based on this, compare the total number of participants who use the Agile methodology and have less than 3 years of work experience with those who have the same criteria but use the Waterfall methodology."
    }
}